/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */

"register" = "注册";
"login" = "登录";
"logout" = "登出";
"password" = "密码";
"username" = "个人账户";
"confirmpassword"="确认密码";

"ok" = "确定";
"yes" = "是";
"cancel" = "取消";
"no" = "否";

"search" = "搜索";
"searching" = "正在搜索";
"error" = "错误";
"delete" = "删除";
"copy" = "复制";
"transpond" = "转发";
"recall" = "撤回";
"save" = "保存";
"prompt" = "提示";
"add" = "添加";
"send" = "发送";
"open" = "打开";
"done" = "完成";
"choose" = "选择";
"accept" = "接受";
"reject" = "拒绝";
"wait" = "请等待...";

"sendingApply" = "正在发送申请...";
"acceptFail" = "接受失败";
"rejectFail" = "拒绝失败";
"transponding" = "正在转发...";
"transpondFail" = "转发失败";
"refreshData" = "刷新数据...";
"loadData" = "加载数据...";
"loadDataFailed" = "加载数据失败";
"saySomething" = "说点啥子吧";
"searchResults" = "搜索结果";
"doneWithCount" = "确定(%i)";
"sureToDelete" = "请确定删除";
"receiveCmd" = "有透传消息";
"receiveMessage" = "您有一条新消息";
"loginAtOtherDevice" = "你的账号已在其他地方登录";
"loginUserRemoveFromServer" = "你的账号已被从服务器端移除";
"deleteFailed" = "删除失败:%@";
"notFound" = "没有找到";
"noMore" = "没有更多数据了";
"hasRead" = "已读";
"servingIsBanned" = "服务被禁用";
"getPermission" = "获取权限";
"recallFailed" = "消息撤回失败:%@";
"error.exceedServiceLimit" = "超过服务器上限";

//app
"AppName" = "环信Demo";

//error des
"error.connectServerFail" = "连接服务器失败!";
"error.connectServerTimeout" = "连接服务器超时!";
"error.connectNetworkFail" = "网络未连接!";
"error.usernotExist" = "用户不存在!";
"error.notFound" = "文件路径不存在";
"error.initPlayerFail" = "初始化AVAudioPlayer失败!";
"error.palyFail" = "播放失败!";
"error.conversionFail" = "初始化AVAudioRecorder失败";
"error.initRecorderFail" = "文件格式转换失败";
"error.recordStoping" = "语音录制还没有结束";
"error.recordNotBegin" = "还没有开始语音录制";
"error.recordTooShort" = "录制时间过短";

//login
"login.beginAutoLogin" = "自动登录中...";
"login.endAutoLogin" = "已自动登录";
"login.errorAutoLogin" = "自动登录失败.";
"login.nameNotSupportZh" = "用户名不支持中文";
"login.ongoing" = "正在登录...";
"login.fail" = "登录失败";
"login.inputNameAndPswd" = "请输入账号和密码";
"login.inputApnsNickname" = "填写推送消息时使用的昵称";

//register
"register.ongoing" = "正在注册...";
"register.fail" = "注册失败";
"register.success" = "注册成功，请登录";
"register.repeat" = "您注册的用户已存在!";
"register.confirmPassword" = "两次输入密码不一致,请重新输入";

//apns
"apns.failToRegisterApns" = "注册推送失败";
"apns.failToBindDeviceToken" = "消息推送与设备绑定失败";
"apns.content" = "推送内容";

//friend
"friend.add" = "添加好友";
"friend.somebodyAddWithName" = "%@ 添加你为好友";
"friend.declinedToAdd" = "'%@'拒绝了你的好友请求";
"friend.acceptedToAdd" = "'%@'同意了你的好友请求";
"friend.inputNameToSearch" = "输入要查找的好友";
"friend.repeat" = "'%@'已经是你的好友了!";
"friend.repeatApply" = "您已向'%@'发送好友请求了!";
"friend.notAddSelf" = "不能添加自己为好友";
"friend.repeatInvite" = "%@已经给你发来了申请";
"friend.somebodyInvite" = "%@ 邀请你为好友";
"friend.sendApply" = "正在发送申请...";
"friend.sendApplyFail" = "发送申请失败，请重新操作";
"friend.sendApplySuccess" = "发送申请成功";
"friend.black" = "黑名单";
"friend.notChatSelf" = "不能跟自己聊天";
"friend.notDeleteSelf" = "不能删除自己";
"friend.block" = "加入黑名单";

//group
"group.somebodyInvite" = "%@ 邀请你加入群组\'%@\'";
"group.applyJoin" = "%@ 申请加入群组\'%@\'";
"group.applyJoinWithName" = "%@ 申请加入群组\'%@\'：%@";
"group.sendApplyFail" = "发送申请失败:%@\n原因：%@";
"group.beRefusedToJoin" = "被拒绝加入群组\'%@\'";
"group.beKicked" = "你被从群组\'%@\'中踢出";
"group.agreedAndJoined" = "同意并已加入群组\'%@\'";
"group.join" = "加入群组";
"group.joined" = "已加入";
"group.owner" = "群主";
"group.describe" = "群组简介";
"group.join.ongoing" = "加入群组...";
"group.join.fail" = "加入群组失败，请重新操作";
"group.sendingApply" = "发送加群申请...";
"group.sendApplyRepeat" = "申请已发送";
"group.maxUserCount" = "群成员个数超了最大值了";
"group.atMe" = "[有人@我]";
"group.atAll" = "[有全体消息]";
"group.atPushTitle" = "在群中@了我";

//Create Group
"group.create.addOccupant" = "添加成员";
"group.create.inputName" = "请输入群组名称";
"group.create.inputDescribe" = "请输入群组简介";
"group.create.groupPermission" = "群组权限";
"group.create.private" = "私有群";
"group.create.occupantPermissions" = "成员邀请权限";
"group.create.allowedOccupantInvite" = "允许群成员邀请其他人";
"group.create.unallowedOccupantInvite" = "不允许群成员邀请其他人";
"group.create.ongoing" = "创建群组...";
"group.create.success" = "创建群组成功";
"group.create.fail" = "创建群组失败，请重新操作";
"group.create.public" = "公有群";
"group.create.occupantJoinPermissions" = "成员加入权限";
"group.create.open" = "随便加入";
"group.create.needApply" = "加入群组需要管理员同意";
"group.create.group" = "新建群聊";
"group.create.join" = "添加公开群";

//Group Bans
"group.ban.removing" = "正在将成员移出黑名单...";
"group.ban.adding" = "正在将成员加入黑名单...";
"group.ban.fetching" = "获取群组黑名单...";
"group.ban.fetchFail" = "获取黑名单失败: %@";

//Group Detail
"group.removeAllMessages" = "清空聊天记录";
"group.destroy" = "解散群组";
"group.leave" = "退出群组";
"group.id" = "群组ID";
"group.owner" = "群主";
"group.admins" = "管理员列表";
"group.members" = "普通成员";
"group.mutes" = "禁言列表";
"group.sharedfiles" = "群共享列表";
"group.announcement" = "群公告";
"group.ext" = "群扩展信息";
"group.ownerAdmin" = "群主 / 管理员";
"group.more" = "查看更多";
"group.remove" = "移除";
"group.block" = "拉黑";
"group.mute" = "禁言";
"group.upgrade" = "升权";
"group.degrade" = "降权";
"group.occupantCount" = "群组人数";
"group.addingOccupant" = "添加组成员...";
"group.fetchInfoFail" = "获取群组详情失败，请稍后重试";
"group.removingOccupant" = "正在删除成员...";
"group.destroyFail" = "解散群组失败";
"group.leaveFail" = "退出群组失败";
"group.addOccupantFail" = "添加群成员失败, 请稍后再试";
"group.removeMember" = "从群组中移除";
"group.removeBan" = "从黑名单中移除";
"group.changeOwner" = "改变群主";
"group.changeOwnerFail" = "改变群主失败";
"group.addAdmin" = "升级为管理员";
"group.removeAdmin" = "移除管理员权限";
"group.toMute" = "禁言";
"group.unmute" = "解除禁言";
"group.upload" = "上传";
"group.download" = "下载 ...";
"group.downloadFail" = "下载群共享文件失败";
"group.fetchMuteFail" = "获取禁言列表失败: %@";
"group.fetchSharedFileFail" = "获取群共享文件列表失败: %@";
"group.fetchAnnouncementFail" = "获取群公告失败";
"group.changeAnnouncementFail" = "修改群公告失败";
"group.changeExtFail" = "修改群扩展信息失败";
"group.onlyOwner" = "只有Owner能进行此操作";

//Group Delegate
"group.update" = "群组更新";
"group.adminUpdate" = "管理员更新";
"group.becomeAdmin" = "变为管理员";
"group.beRemovedAdmin" = "被移出管理员";
"group.ownerUpdate" = "群主更新";
"group.membersUpdate" = "群成员更新";
"group.announcementUpdate" = "群公告更新";
"group.sharedFileUpdate" = "群文件更新";
"group.changeOwnerTo" = "群主由 %@ 变为 %@";
"group.clearAnnouncement" = "群组:%@ 公告被删除";
"group.updateAnnouncement" = "群组:%@ 公告内容: %@";
"group.uploadSharedFile" = "群组:%@ 上传文件ID: %@";
"group.removeSharedFile" = "群组:%@ 删除文件ID: %@";
"group.leaved" = "从群组中离开";
"group.kicked" = "你被踢出群组: %@ [%@]";
"group.destroyed" = "群组被销毁: %@ [%@]";
"group.muteSuccess" = "禁言成功";
"group.inviteSomeone" = "%@ 邀请你加入群组: %@ [%@]";
"group.declinedInvite" = "%@ 拒绝群组 %@ [%@] 的入群邀请";
"group.acceptedInvite" = "%@ 已同意群组 %@ [%@] 的入群邀请";

//Group Setting
"group.setting.receiveAndPrompt" = "接收并提示群消息";
"group.setting.receiveAndUnprompt" = "只接收不提示群消息";
"group.setting.blockMessage" = "屏蔽群消息";
"group.setting.save" = "设置属性";
"group.setting.success" = "设置成功";
"group.setting.fail" = "设置失败";
"group.setting.subject" = "请输入群组名称";
"group.setting.announcement" = "请输入群公告";
"group.setting.ext" = "请输入群扩展信息";

//Chatroom detail
"chatroom.join" = "加入";
"chatroom.somebodyInvite" = "%@ 邀请你加入聊天室\'%@\'";
"chatroom.id" = "聊天室Id";
"chatroom.owner" = "创建者";
"chatroom.admins" = "管理员";
"chatroom.onlineMembers" = "在线成员列表";
"chatroom.blacklist" = "黑名单列表";
"chatroom.mutes" = "被禁言成员";
"chatroom.occupantCount" = "聊天室人数";
"chatroom.description" = "描述";
"chatroom.announcement" = "聊天室公告";
"chatroom.joining" = "正在加入...";
"chatroom.fetchInfoFail" = "获取聊天室详情失败";
"chatroom.joinFailed" = "加入聊天室\'%@\'失败";
"chatroom.join" = "\'%@\'加入聊天室\'%@\'";
"chatroom.leave.hint" = "\'%@\'离开聊天室\'%@\'";
"chatroom.remove" = "被踢出聊天室\'%@\'";
"chatroom.removeForOffline" = "离开聊天室\'%@\', 原因：账号离线. 是否重新加入聊天室？";
"chatroom.create.inputName" = "请输入聊天室名称";
"chatroom.create.inputDescribe" = "请输入聊天室简介";
"chatroom.create.ongoing" = "创建聊天室...";
"chatroom.create.success" = "创建聊天室成功";
"chatroom.create.fail" = "创建聊天室失败，请重新操作";
"chatroom.changeAnnouncementFail" = "修改公告失败";
"chatroom.fetchAnnouncementFail" = "获取公告失败";

"chatroom.destroy" = "解散聊天室";
"chatroom.leave" = "退出聊天室";
"chatroom.destroyFail" = "解散聊天室失败";
"chatroom.leaveFail" = "退出聊天室失败";

//chatroom delegate
"chatroom.update" = "聊天室更新";
"chatroom.mute" = "禁言成员";
"chatroom.unmute" = "解除禁言";
"chatroom.adminUpdate" = "管理员更新";
"chatroom.becomeAdmin" = "%@ 变为管理员";
"chatroom.beRemovedAdmin" = "%@ 被移出管理员";
"chatroom.changeOwnerTo" = "聊天室创建者由 %@ 变为 %@";
"chatroom.ownerUpdate" = "聊天室创建者更新";
"chatroom.announcementUpdate" = "聊天室公告更新";
"chatroom.clearAnnouncement" = "聊天室:%@ 公告被删除";
"chatroom.updateAnnouncement" = "聊天室:%@ 公告内容: %@";

//call
"call.initFailed"="创建实时通话失败，请稍后重试";
"call.waiting"="等待接听...";
"call.connecting"="正在建立连接...";
"call.silence"="静音";
"call.speaker"="免提";
"call.reject"="拒接";
"call.answer"="接听";
"call.hangup"="挂断";
"call.finished"="连接建立完成";
"call.autoHangup"="没有响应，自动挂断";
"call.noResponse"="对方没有回应";
"call.connectFailed"="建立连接失败";
"call.connectUnsupported"="功能不支持";
"call.failed"="通话失败";
"call.offline"="对方不在线";
"call.suspended"="通话已挂断";
"call.over"="通话结束";
"call.cancel"="取消通话";
"call.rejected"="拒接通话";
"call.in"="正在通话中...";
"call.speak"="可以说话了...";
"call.speak.relay"="可以说话了...Relay";
"call.speak.direct"="可以说话了...Direct";
"call.init"="正在初始化通话...";
"call.dealloc"="正在结束通话...";
"call.videoSize"="宽/高: ";
"call.videoTimedelay"="延迟: ";
"call.videoFramerate"="帧率: ";
"call.videoLostcnt"="丢包数: ";
"call.videoLocalBitrate"="本地比特率: ";
"call.videoRemoteBitrate"="对方比特率: ";
"call.switchCamera"="切换摄像头";

//message
"message.image" = "图片";
"message.location" = "位置";
"message.voice" = "音频";
"message.video" = "视频";
"message.image1" = "[图片]";
"message.location1" = "[位置]";
"message.voice1" = "[音频]";
"message.video1" = "[视频]";
"message.file1" = "[文件]";
"message.beginReceiveOffine" = "开始接收离线消息";
"message.endReceiveOffine" = "离线消息接收成功";
"message.toolBar.inputPlaceHolder" = "输入新消息";
"message.toolBar.record.upCancel" = " 手指上滑，取消发送 ";
"message.toolBar.record.loosenCancel" = " 松开手指，取消发送 ";
"message.toolBar.record.touch" = "按住说话";
"message.toolBar.record.send" = "松开发送";

"message.downloadingAudio" = "正在下载语音，稍后点击";
"message.downloadingVideo" = "正在获取视频...";
"message.videoFail" = "视频获取失败!";
"message.downloadingImage" = "正在获取大图...";
"message.imageFail" = "大图获取失败!";
"message.thumImageFail" = "缩略图获取失败!";
"message.simulatorNotSupportCamera" = "模拟器不支持拍照";
"message.simulatorNotSupportVideo" = "模拟器不支持录像";
"message.startRecordFail" = "开始录音失败";
"message.noMessage" = "消息已经清空";
"message.forbiddenWords" = "你的消息包含不当言论";
"message.recall" = "您撤回了一条消息";
"message.recallByOthers" = "%@撤回了一条消息";
"message.autoTransfer" = "请自定义上传或者下载附件方法";
"message.deleteConversation" = "是否删除对应的会话?";

//media
"media.timeShort" = "录音时间太短了";

//network
"network.disconnection" = "当前网络连接失败";

//reconnection
"reconnection.retry" = "你的账号登录失败，正在重试中... \n点击 '登出' 按钮跳转到登录页面 \n点击 '继续等待' 按钮等待重连成功";
"reconnection.ongoing" = "正在重连中...";
"reconnection.fail" = "重连失败，稍候将继续重连";
"reconnection.success" = "重连成功！";
"reconnection.wait" = "继续等待";

//location
"location.messageType" = "位置信息";
"location.fail" = "定位失败";
"location.ongoning" = "正在定位...";

//title
"title.conversation" = "会话";
"title.addressbook" = "通讯录";
"title.setting" = "设置";
"title.group" = "群组";
"title.chatroom" = "聊天室";
"title.mychatroom" = "我的聊天室";
"title.chooseContact" = "选择联系人";
"title.debug" = "诊断";
"title.groupBlackList" = "黑名单列表";
"title.createGroup" = "创建群组";
"title.publicGroup" = "公有群组";
"title.groupSetting" = "群设置";
"title.apnsSetting" = "消息推送设置";
"title.buddyBlock" = "黑名单";
"title.apply" = "申请与通知";
"title.groupApply" = "群组通知";
"title.groupSubjectChanging" = "修改群名称";
"title.groupAnnouncementChanging" = "修改群公告";
"title.groupExtChanging" = "修改群扩展信息";
"title.groupSearchMessage" = "查找聊天记录";
"title.groupInfo" = "群详情";
"title.chatroom" = "聊天室";
"title.robotlist" = "环信助手";
"title.profile" = "详细资料";
"title.createChatroom" = "创建聊天室";
"title.autoTransferAttachments" = "消息附件上传到环信服务器";
"title.autoDownloadThumbnail" = "是否自动下载缩略图";
"title.extensions" = "扩展功能";
"title.sendNotifMsg" = "发送群通知消息";
"title.notifMsg" = "群组通知消息";
"title.readList" = "已读成员列表";


//setting
"setting.autoLogin" = "自动登录";
"setting.loginUser" = "退出登录(%@)";
"setting.logoutOngoing" = "正在退出...";
"setting.sortbyservertime" = "消息根据服务器时间排序";
"setting.enableDeliveryAck" = "是否自动发送消息送达回执";

"setting.notDisturb" = "功能消息免打扰";
"setting.showDetail" = "通知显示消息详情";
"setting.open" = "开启";
"setting.nightOpen" = "只在夜间开启 (22:00 - 7:00)";
"setting.close" = "关闭";
"setting.sureNotDisturb" = "此设置会导致全天都处于免打扰模式, 不会再收到推送消息. 是否继续?";
"setting.messageRource" = "优先服务器获取消息";

"setting.uploadLog" = "上传运行日志";
"setting.sdkVersion" = "SDK 版本";
"setting.emailLog" = "邮件发送日志";
"setting.deviceResources" = "登录设备列表";
"setting.serviceDiagnose" = "服务诊断";
"setting.serviceCheck" = "诊断";
"setting.kickAllDevices" = "踢掉所有";
"setting.uploading" = "正在上传...";
"setting.uploadSuccess" = "上传成功";
"setting.uploadFail" = "上传失败";
"setting.editName" = "更改昵称";
"setting.inputName" = "请输入新昵称";
"setting.saveName" = "保存更改昵称";
"setting.namenotempty" = "昵称不能为空";
"setting.personalInfo" = "个人信息";
"setting.personalInfoUpload" = "头像";
"setting.edittips" = "设置此昵称以后,在与iOS客户端demo聊天工程中,iOS一侧会显示此昵称而不是环信ID,如果对方使用安卓客户端则此设置不生效";
"setting.iospushname" = "iOS离线推送昵称";
"setting.useIp" = "使用IP";
"setting.deleteConWhenLeave" = "退群时删除会话";
"setting.autoAcceptGrupInvite" = "自动同意进群邀请";
"setting.microphoneNoAuthority" = "未获得授权使用麦克风";
"setting.microphoneAuthority" = "请在iOS\"设置中\"-\"隐私\"-\"麦克风\"中打开";
"setting.cameraNoAuthority" = "未获得授权使用相机";
"setting.cameraAuthority" = "请在iOS\"设置中\"-\"隐私\"-\"相机\"中打开";
"setting.cameraUpload" = "拍照上传";
"setting.localUpload" = "相册上传";
"setting.profileNickname" = "昵称";
"setting.saving" = "修改中...";
"setting.saveFailed" = "修改失败";

"setting.message" = "消息设置";
"setting.message.showTyping" = "单聊显示\"正在输入\"";

"setting.call" = "音视频设置";
"setting.call.fixedResolution" = "固定视频分辨率";
"setting.call.autoResolution" = "自动调配视频分辨率";
"setting.call.maxVKbps" = "视频最大码率";
"setting.call.maxVKbpsTips" = "视频码率范围在150-1000";
"setting.call.push" = "是否发送离线推送";
"setting.call.resolution" = "视频分辨率";
"setting.call.maxFramerate" = "视频最大帧率";
"setting.call.minVKbps" = "视频最小码率";
"setting.call.showInfo" = "显示视频通话信息";
"setting.call.audioMix" = "是否使用混音";

//NSDateCategory
"NSDateCategory.text1" = "1分钟内";
"NSDateCategory.text2" = "%.f分钟前";
"NSDateCategory.text3" = "%.f小时前";
"NSDateCategory.text4" = "%.f天前";
"NSDateCategory.text5" = "M月d日";
"NSDateCategory.text6" = "%.f年前";
"NSDateCategory.text7" = "昨天 %@";
"NSDateCategory.text8" = "昨天HH:mm";
"NSDateCategory.text9" = "凌晨hh:mm";
"NSDateCategory.text10" = "上午hh:mm";
"NSDateCategory.text11" = "下午hh:mm";
"NSDateCategory.text12" = "晚上hh:mm";
"NSDateCategory.text13" = "昨天HH:mm";
"NSDateCategory.text14" = "今天 %@";

//multi devices
"alert.multi.contact" = "好友多设备通知";
"alert.multi.group" = "群组多设备通知";
"alert.multi.tooManyDevices" = "登录设备数已达上限";

//multi call
"title.conference" = "多人音视频会议";
"title.customConference" = "自定义多人视频会议";
"alert.conference.createFail" = "创建或者加入会议失败!";
"alert.conference.pubFail" = "上传数据流失败!";
"alert.conference.inviteFail" = "发送邀请失败!";
"alert.conference.inviteSuccess" = "发送邀请成功!";
"alert.conference.subFail" = "订阅数据流 %@ 失败!";
"hint.conference.userJoin" = "%@ 已经加入会议";
"hint.conference.userLeave" = "%@ 已经离开会议";
"alert.conference.closed" = "会议已经关闭";
"network.conference.normal" = "网络变化：网络正常";
"network.conference.unstable" = "网络变化：数据不稳定";
"network.conference.dis" = "网络变化：网络已经断开";
"title.conference.addUser" = "添加成员";

"title.conference.default" = "默认";
"title.conference.custom" = "自定义";
